# -*- coding: utf-8 -*-
"""task_2.3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1OCRFVW8Msz1vQuAwyPWgMt_ZS_uEHrNQ

# Задача 2.3
"""

# Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# Например,
# switch_it_up(1) -> 'One'
# switch_it_up(3) -> 'Three'
# switch_it_up(10000) -> None
# Использовать условный оператор if-elif-else нельзя!

def switch_it_up(number):
  print("sweetch_it_up(", number, ") -> ", numbers[number-1])
    
numbers = ["One", "Two", "Three", "Four", "Five", "Six", "Seven", "Eight", "Nine"]
number = int(input("Введите число "))
try:
  switch_it_up(number)
except IndexError:
  print("sweetch_it_up(", number, ") -> ", None)