# -*- coding: utf-8 -*-
"""Копия блокнота "task_1.1.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/16vq9-wP6L1Najeafxm-NZ3O5-ODiyA0X

Задача 1.1.
"""

# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
splitted_line = my_favorite_songs.split(',')
print(splitted_line[0], splitted_line[-1], splitted_line[1], splitted_line[-2])