# -*- coding: utf-8 -*-
"""task_1.3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1u55hVg9TrDKGb1YKVNi4C93oeDe_MD9s

#Задача 1.3
"""

# Напишите скрипт, который принимает от пользователя номер месяца, 
# а возвращает количество дней в нем.
# Результат проверки вывести на консоль
# Допущение: в феврале 28 дней
# Если номер месяца некорректен - сообщить об этом

# Например,
    # Введите номер месяца: 3
    # Вы ввели март. 31 дней

    # Введите номер месяца: 2
    # Вы ввели февраль. 28 дней

    # Введите номер месяца: 15
    # Такого месяца нет!

monthes = [{"январь" : 31},
           {"февраль" : 28},
           {"март" : 31},
           {"апрель" : 30},
           {"май" : 31},
           {"июнь" : 30},
           {"июль" : 31},
           {"август" : 31},
           {"сентябрь" : 30},
           {"октябрь" : 31},
           {"ноябрь" : 30},
           {"декабрь" :31},
           
           ]
user_text = int(input('Укажите номер месяца '))
if user_text in range(1, len(monthes)+1):
  answer = monthes[user_text - 1]
  for i in answer:
    print('Вы ввели ', i, ".", answer[i], "дней")
else:
  print("Такого месяца нет")