# -*- coding: utf-8 -*-
"""task_2.2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1Mm1y5Z37MsaymI4dqAo9eQIc7jnps8W8

#Задача 2.2
"""

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например: 
# месяц 2 (февраль) является частью первого квартала; 
# месяц 6 (июнь) является частью второго квартала; 
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
  if 0 < month <= 3:
    quarter = "первого" 
  elif 3 < month <= 6:
    quarter = "второго" 
  elif 6 < month <= 9:
    quarter = "третьего" 
  elif 9 < month <= 12:
    quarter = "четвертого" 
  print(f"месяц {month} ({monthes[month - 1]}) является частью {quarter} квартала")

monthes = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
month = int(input("Введите номер месяца "))
quarter_of(month)